// задание 1
// пример 1
let a = 1, b = 1, c, d;
/*
    a = a + 1 (a = 1 + 1)
    c = a (c = 2)
*/
c = ++a; 
alert(c); // ответ: 2

//пример 2
/*
    d = b ( b = 1)
    b = b + 1
*/
d = b++;
alert(d); //ответ: 1

//пример 3
/*
    в примере 1  ++a  a стало 2
    a = a + 1 (a = 2 + 1)    
    c = 2 + 3 = 5
*/
c = 2 + ++a;
alert(c); //ответ: 5

//пример 4
/*
    в примере 2  b++  b стало 2
    d = 2 + b  (d = 2 + 2) 
    в примере 1 a = 2
    ++а = 2 + 1
    b++ = b + 1 = 2 + 1

*/
d = 2 + b++;
alert(d); //ответ: 4
alert(a); //3
alert(b); //3